samples/java-server/lib/com/example/farandula-example/1.3.2/farandula-example-1.3.2/travelport/XML.request/AirAvailability_Rq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <air:AvailabilitySearchReq xmlns:air="http://www.travelport.com/schema/air_v34_0" AuthorizedBy="user" TargetBranch="${targetBranch}" TraceId="trace">
            <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v34_0" OriginApplication="UAPI"/>
            <air:SearchAirLeg>
                <air:SearchOrigin>
                    <com:Airport xmlns:com="http://www.travelport.com/schema/common_v34_0" Code="${departureAirport}"/>
                </air:SearchOrigin>
                <air:SearchDestination>
                    <com:Airport xmlns:com="http://www.travelport.com/schema/common_v34_0" Code="${arrivalAirport}"/>
                </air:SearchDestination>
                <air:SearchDepTime PreferredTime="${departureDate}"/>
            </air:SearchAirLeg>
            <air:AirSearchModifiers>
                <air:PreferredProviders>
                    <com:Provider xmlns:com="http://www.travelport.com/schema/common_v34_0" Code="1G"/>
                </air:PreferredProviders>
            </air:AirSearchModifiers>
        </air:AvailabilitySearchReq>
    </soapenv:Body>
</soapenv:Envelope>
